title: Detección de Secuestro de Dominio
id: "c3d4e5f6-a7b8-4c9d-0e1f-2a3b4c5d6e7f" # Nuevo ID generado
status: critical
description: |
  Detección de posibles intentos de secuestro de dominio.
author: aguztynbassi
date: 2024/07/18
modified: 2024/07/18
logsource:
  product: your_dns_provider # Reemplazar con el producto de su proveedor de DNS o sistema de monitoreo de dominios
  service: domain_activity # Servicio que registra la actividad del dominio
  category: network # Categoría para eventos de red
detection:
  selection:
    status: 'hijacked' # El estado del dominio es "hijacked"
  condition: selection
fields:
  - Timestamp
  - domain_name # Nombre del dominio afectado
  - old_nameservers # Servidores de nombres anteriores (si están disponibles)
  - new_nameservers # Nuevos servidores de nombres (si están disponibles)
  - registrant_email # Correo electrónico del registrante (si está disponible)
  - source_ip # Dirección IP desde la que se detectó la actividad (si está disponible)
  - activity # La actividad (ej. cambio de nameservers, cambio de registrador)
tags:
  - attack.tactic: TA0042 # Desarrollo de Recursos
  - attack.technique: T1584.001 # Comprometer Infraestructura: Cuentas de Dominio
platforms:
  - network # Plataforma de red, ya que se refiere a la infraestructura de dominio.
level: critical # Nivel de severidad crítico debido a la naturaleza de la amenaza.
