title: Actividad Sospechosa de Svchost Detectada
id: "2e7f8a9b-0c1d-4e5f-6a7b-8c9d0e1f2a3b" # Nuevo ID generado
status: high
description: |
  Detecta actividad anómala de `svchost.exe`. Es inusual que `svchost.exe` se inicie sin argumentos de línea de comandos significativos y normalmente se observa cuando un proceso malicioso lo genera e inyecta código en su espacio de memoria.
author: aguztynbassi
date: 2024/07/18
modified: 2024/07/18
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1 # Sysmon Event ID para creación de proceso
    Image|endswith: '\svchost.exe'
    CommandLine|contains: '*svchost.exe*' # La línea de comandos existe y contiene el nombre del ejecutable
  filter_parent_image:
    ParentImage|endswith: # Excluir imágenes de procesos padres legítimos
      - '\rpcnet.exe'
      - '\rpcnetp.exe'
      - '\svchost.exe'
      - '\Mrt.exe'
      - '\MsMpEng.exe'
  filter_users:
    User|startswith: # Excluir cuentas del sistema y de servicio
      - 'NT AUTHORITY\'
      - 'LOCAL SERVICE'
      - 'NETWORK SERVICE'
      # Considerar añadir más usuarios o grupos legítimos que puedan generar svchost.exe de forma autorizada.
  condition: selection AND NOT filter_parent_image AND NOT filter_users
fields:
  - EventID
  - Timestamp
  - Image # Ruta completa del ejecutable
  - CommandLine
  - User
  - Computer
  - ParentImage
tags:
  - attack.tactic: TA0004 # Escalada de Privilegios
  - attack.tactic: TA0005 # Evasión de Defensas
  - attack.technique: T1055 # Inyección de Procesos
level: high # Nivel de severidad de la detección
