title: Suspicious SMB Named Pipe Access
id: 8e9f1a2b-3c4d-5e6f-7a8b-9c0d1e2f3a4b  # Reemplaza con un UUID generado si lo deseas
description: Suspicious named pipe access detected.
status: experimental
author: aguztynbassi
date: 2024/05/25
logsource:
  product: windows
detection:
  selection:
    EventID:
      - 3101
      - 3102
    User|not_in: EXCLUDED_USERS
  condition: selection
fields:
  - SubjectUserName
  - PipeName
  - ProcessName
falsepositives:
  - Legitimate administrative or backup activity
level: medium
tags:
  - attack.tactic: TA0005 # Defense Evasion
  - attack.tactic: TA0011 # Application Layer Protocol
  - attack.technique: t1091 # Replication Through Removable Media
references:
  - https://attack.mitre.org/techniques/T1091/ # MITRE ATT&CK T1091 (Replication Through Removable Media)
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-3101 # Event 3101 documentation
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-3102 # Event 3102 documentation