title: PowerView PowerShell Commandlets Detected
id: "f1a2b3c4-d5e6-4f7a-8b9c-0d1e2f3a4b5c" # Nuevo ID generado con UUID
status: high
description: |
  Detecta la ejecución de commandlets de PowerShell del popular módulo PowerView del framework PowerSploit. Para que la alerta funcione, el registro de bloques de script debe estar habilitado.
author: aguztynbassi
date: 2024/07/18
modified: 2024/07/18
logsource:
  product: windows
  service: powershell # Event ID 4104 es de PowerShell Script Block Logging
  category: scripting
detection:
  selection:
    EventID: 4104 # PowerShell Script Block Logging
    ScriptBlockText|contains: # Contiene cualquiera de los siguientes commandlets
      - 'Export-PowerViewCSV'
      - 'Get-IPAddress'
      - 'Resolve-IPAddress'
      - 'Convert-NameToSid'
      - 'ConvertTo-SID'
      - 'Convert-ADName'
      - 'ConvertFrom-UACValue'
      - 'Add-RemoteConnection'
      - 'Remove-RemoteConnection'
      - 'Invoke-UserImpersonation'
      - 'Invoke-RevertToSelf'
      - 'Request-SPNTicket'
      - 'Get-DomainSPNTicket'
      - 'Invoke-Kerberoast'
      - 'Get-PathAcl'
      - 'Get-DNSZone'
      - 'Get-DomainDNSZone'
      - 'Get-DNSRecord'
      - 'Get-DomainDNSRecord'
      - 'Get-NetDomain'
      - 'Get-Domain'
      - 'Get-NetDomainController'
      - 'Get-DomainController'
      - 'Get-NetForest'
      - 'Get-Forest'
      - 'Get-NetForestDomain'
      - 'Get-ForestDomain'
      - 'Get-NetForestCatalog'
      - 'Get-ForestGlobalCatalog'
      - 'Find-DomainObjectPropertyOutlier'
      - 'Get-NetUser'
      - 'Get-DomainUser'
      - 'New-DomainUser'
      - 'Set-DomainUserPassword'
      - 'Get-UserEvent'
      - 'Get-DomainUserEvent'
      - 'Get-NetComputer'
      - 'Get-DomainComputer'
      - 'Get-ADObject'
      - 'Get-DomainObject'
      - 'Set-ADObject'
      - 'Set-DomainObject'
      - 'Get-ObjectAcl'
      - 'Get-DomainObjectAcl'
      - 'Add-ObjectAcl'
      - 'Add-DomainObjectAcl'
      - 'Invoke-ACLScanner'
      - 'Find-InterestingDomainAcl'
      - 'Get-NetOU'
      - 'Get-DomainOU'
      - 'Get-NetSite'
      - 'Get-DomainSite'
      - 'Get-NetSubnet'
      - 'Get-DomainSubnet'
      - 'Get-DomainSID'
      - 'Get-NetGroup'
      - 'Get-DomainGroup'
      - 'New-DomainGroup'
      - 'Find-ManagedSecurityGroups'
      - 'Get-DomainManagedSecurityGroup'
      - 'Get-NetGroupMember'
      - 'Get-DomainGroupMember'
      - 'Add-DomainGroupMember'
      - 'Get-NetFileServer'
      - 'Get-DomainFileServer'
      - 'Get-DFSShare'
      - 'Get-DomainDFSShare'
      - 'Get-NetGPO'
      - 'Get-DomainGPO'
      - 'Get-NetGPOGroup'
      - 'Get-DomainGPOLocalGroup'
      - 'Find-GPOLocation'
      - 'Get-DomainGPOUserLocalGroupMapping'
      - 'Find-GPOComputerAdmin'
      - 'Get-DomainGPOComputerLocalGroupMapping'
      - 'Get-DomainPolicy'
      - 'Get-NetLocalGroup'
      - 'Get-NetLocalGroupMember'
      - 'Get-NetShare'
      - 'Get-NetLoggedon'
      - 'Get-NetSession'
      - 'Get-LoggedOnLocal'
      - 'Get-RegLoggedOn'
      - 'Get-NetRDPSession'
      - 'Invoke-CheckLocalAdminAccess'
      - 'Test-AdminAccess'
      - 'Get-SiteName'
      - 'Get-NetComputerSiteName'
      - 'Get-Proxy'
      - 'Get-WMIRegProxy'
      - 'Get-LastLoggedOn'
      - 'Get-WMIRegLastLoggedOn'
      - 'Get-CachedRDPConnection'
      - 'Get-WMIRegCachedRDPConnection'
      - 'Get-RegistryMountedDrive'
      - 'Get-WMIRegMountedDrive'
      - 'Get-NetProcess'
      - 'Get-WMIProcess'
      - 'Find-InterestingFile'
      - 'Invoke-UserHunter'
      - 'Find-DomainUserLocation'
      - 'Invoke-ProcessHunter'
      - 'Find-DomainProcess'
      - 'Invoke-EventHunter'
      - 'Find-DomainUserEvent'
      - 'Invoke-ShareFinder'
      - 'Find-DomainShare'
      - 'Invoke-FileFinder'
      - 'Find-InterestingDomainShareFile'
      - 'Find-LocalAdminAccess'
      - 'Invoke-EnumerateLocalAdmin'
      - 'Find-DomainLocalGroupMember'
      - 'Get-NetDomainTrust'
      - 'Get-DomainTrust'
      - 'Get-NetForestTrust'
      - 'Get-ForestTrust'
      - 'Find-ForeignUser'
      - 'Get-DomainForeignUser'
      - 'Find-ForeignGroup'
      - 'Get-DomainForeignGroupMember'
      - 'Invoke-MapDomainTrust'
      - 'Get-DomainTrustMapping'
  filter_excluded_users:
    User|startswith: # Excluye cuentas del sistema y de servicio. Ajustar según el entorno.
      - 'NT AUTHORITY\'
      - 'LOCAL SERVICE'
      - 'NETWORK SERVICE'
      # Añadir otros usuarios o grupos legítimos que puedan generar esta actividad de forma autorizada.
  condition: selection AND NOT filter_excluded_users
fields:
  - Timestamp
  - EventID
  - User
  - ComputerName
  - ScriptBlockText # El contenido completo del script de PowerShell
  - ProcessName # El proceso que ejecuta PowerShell (powershell.exe)
tags:
  - attack.tactic: TA0002 # Ejecución
  - attack.technique: T1059 # Intérprete de Comandos y Scripts
  - attack.subtechnique: T1059.001 # PowerShell
platforms:
  - windows
level: high # Nivel de severidad de la detección
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4104
  - https://learn.microsoft.com/en-us/powershell/module/powersploit/ # Documentación de PowerSploit