title: Proceso Hijo Sospechoso de WMPRVSE Detectado
id: "1c2d3e4f-5a6b-7c8d-9e0f-1a2b3c4d5e6f" # Nuevo ID generado
status: high
description: |
  Detecta un proceso hijo sospechoso de WMIC (WMPRVSE). Esta actividad puede indicar un intento de movimiento lateral o ejecución de código por parte de un adversario.
author: aguztynbassi
date: 2024/07/18
modified: 2024/07/18
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1 # Sysmon Event ID for Process Creation
    ParentImage|endswith: '\wmprvse.exe'
  filter:
    Image|endswith:
      - 'C:\Windows\System32\conhost.exe'
      - 'C:\Windows\system32\wbem\WMIC.exe'
      - 'C:\Windows\syswow64\wbem\WMIC.exe'
      - 'C:\Windows\system32\WerFault.exe'
      - 'C:\Windows\SysWOW64\WerFault.exe'
  condition: selection AND NOT filter
fields:
  - Timestamp
  - EventID
  - User
  - Computer
  - Image # Proceso hijo
  - ParentImage # Proceso padre (wmprvse.exe)
  - CommandLine # Línea de comandos del proceso hijo
tags:
  - attack.tactic: TA0002 # Ejecución
  - attack.tactic: TA0007 # Movimiento Lateral
  - attack.technique: T1047 # Windows Management Instrumentation
level: high # Nivel de severidad de la detección
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
  - https://attack.mitre.org/techniques/T1047/
  - https://www.elastic.co/guide/en/security/current/detection-engine-rules-dsl-reference.html
  - https://www.elastic.co/guide/en/security/current/detection-engine-rules-field-reference.html
  - https://www.elastic.co/blog/detecting-lateral-movement-with-elastic-security