title: Suspicious PowerShell Execution
id: 3d4e5f6a-7b8c-4d9e-8f1a-2b3c4d5e6f7a  # Reemplaza con un UUID generado si lo deseas
description: Detection of suspicious PowerShell command execution indicating possible malicious activity.
status: experimental
author: aguztynbassi
date: 2024/05/25
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4104
    Message|contains: 'IEX'
  condition: selection
fields:
  - SubjectUserName
  - ScriptBlockText
  - ProcessName
falsepositives:
  - Legitimate administrative scripts using Invoke-Expression
level: high
tags:
  - attack.tactic: TA0002 # Execution
  - attack.technique: t1059.001 # PowerShell
references:
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies # PowerShell Execution Policies
  - https://attack.mitre.org/techniques/T1059/001/ # MITRE ATT&CK T1059.001 (PowerShell)