title: Remote Desktop Connection
id: 2f3c4b5d-8e7a-4c2b-9d1e-3a4b5c6d7e8f  # Reemplaza con un UUID generado si lo deseas
description: Detects remote desktop connections to critical systems.
status: experimental
author: aguztynbassi
date: 2024/05/25
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 10
  condition: selection
fields:
  - SubjectUserName
  - IpAddress
  - WorkstationName
falsepositives:
  - Legitimate remote desktop usage by administrators or support staff
level: medium
tags:
  - attack.tactic: TA0008 # Lateral Movement
  - attack.technique: t1021 # Remote Services