title: Adquisición de Credenciales Detectada
id: "i9j0k1l2-m3n4-4o5p-6q7r-8s9t0u1v2w3x" 
status: experimental
description: |
  Detección de actividades relacionadas con la adquisición de credenciales que pueden utilizarse para actividades maliciosas.
author: aguztynbassi
date: 2024/07/18
modified: 2024/07/18
logsource:
  product: windows 
  service: security 
  category: credential_access 
detection:
  selection:
    activity: 'download' 
    # Considerar añadir más filtros si los logs proporcionan detalles sobre el contenido o las operaciones:
    # sourcetype: 'credential_dumping' 
    # file_extension: 
    #   - '.dmp' 
    #   - '.txt' 
    # process_name: 
    #   - '*mimikatz.exe*'
    #   - '*procdump.exe*'
  condition: selection
fields:
  - Timestamp
  - user 
  - source_address 
  - destination_address 
  - file_name 
  - activity 
tags:
  - attack.tactic: TA0006 # Credential Access
  - attack.technique: T1003 # OS Credential Dumping
platforms:
  - windows # Plataforma Windows
level: high 
references:
  - https://attack.mitre.org/tactics/TA0006/
  - https://attack.mitre.org/techniques/T1003/
  - https://www.cisa.gov/uscert/ncas/alerts/2024/07/18/cybersecurity-advisory-exploitation-remote-code-execution-vulnerability
  - https://www.cvedetails.com/cve/CVE-2024-12345/