title: Mimikatz Execution Detection
id: 4a5b6c7d-8e9f-4a1b-9c2d-3e4f5a6b7c8d  # Reemplaza con un UUID generado si lo deseas
description: Detection of the Mimikatz tool execution which is often used for credential dumping.
status: experimental
author: aguztynbassi
date: 2024/05/25
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4688
    CommandLine|contains: 'mimikatz'
  condition: selection
fields:
  - SubjectUserName
  - NewProcessName
  - CommandLine
falsepositives:
  - Security testing or red team activity
level: high
tags:
  - attack.tactic: TA0006 # Credential Access
  - attack.technique: T1003 # Credential Dumping
references:
  - https://attack.mitre.org/techniques/T1003/001/ # Credential Dumping: Mimikatz